In [1]:
import pandas as pd
import numpy as np
# Create Data
stuff = {
    'Corporation':['Apple', 'Google', 'Meta', 'Apple', 'Google','Meta'],
    'Employees':['John', 'April', 'Wes', 'Beth', 'Justin', 'Steph'],
    'Salary':[200, 220, 190, 130, 120, 150]}
# Create Dataframe
my_df = pd.DataFrame(stuff)
my_df

  Corporation Employees  Salary
0       Apple      John     200
1      Google     April     220
2        Meta       Wes     190
3       Apple      Beth     130
4      Google    Justin     120
5        Meta     Steph     150

In [2]:
# Group by 'Corporation' - get object location in memory
company = my_df.groupby('Corporation')
company

In [3]:
# sum
company.sum()

/tmp/ipykernel_321908/3285343041.py:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  company.sum()

             Salary
Corporation
Apple           330
Google          340
Meta            340

In [4]:
# mean
company.mean()

/tmp/ipykernel_321908/3820310048.py:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  company.mean()

             Salary
Corporation
Apple         165.0
Google        170.0
Meta          170.0

In [5]:
# max min - includes strings sorted alphabetically
company.max()

            Employees  Salary
Corporation
Apple            John     200
Google         Justin     220
Meta              Wes     190

In [6]:
# standard deviation
company.std()

/tmp/ipykernel_321908/3601040469.py:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.std is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  company.std()

                Salary
Corporation
Apple        49.497475
Google       70.710678
Meta         28.284271

In [7]:
# variance
company.var()

/tmp/ipykernel_321908/1147168229.py:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.var is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  company.var()

             Salary
Corporation
Apple        2450.0
Google       5000.0
Meta          800.0

In [8]:
company.count()

             Employees  Salary
Corporation
Apple                2       2
Google               2       2
Meta                 2       2

In [9]:
company.describe()

            Salary
             count   mean        std    min    25%    50%    75%    max
Corporation
Apple          2.0  165.0  49.497475  130.0  147.5  165.0  182.5  200.0
Google         2.0  170.0  70.710678  120.0  145.0  170.0  195.0  220.0
Meta           2.0  170.0  28.284271  150.0  160.0  170.0  180.0  190.0